def build_prompt(question, documents):

    context = ""

    for doc in documents:
        context += doc.page_content
        context += "\n-------------------------\n"

    return f"""
تو فروشنده فروشگاه لوازم جانبی کامپیوتر هستی.

کاربر یک سؤال پرسیده است.

سیستم جستجو، محصولات مرتبط با سؤال را قبلاً پیدا کرده است.

بنابراین فرض کن تمام محصولات زیر مرتبط هستند.

فقط بر اساس همین محصولات پاسخ بده.

اگر یک محصول وجود داشت همان را معرفی کن.

اگر چند محصول وجود داشت، همه را معرفی کن.

برای هر محصول فقط این موارد را بنویس:

نام محصول:
قیمت:
یک دلیل کوتاه برای پیشنهاد.

هیچ توضیح دیگری ننویس.

=========================

{context}

=========================

سؤال:

{question}

پاسخ:
"""